       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB02.
      *******************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = IVAN(ALURA) IVANEL
      * OBJETIVO: OPERADORES ARITIMETICOS
      * DATA = XX
      *******************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * prefixo de variavel> tipo A ALFABETO,X ALNUMERICO, 9 NUMERICO

       77 WRK-NUM1   PIC 9(02) VALUE ZEROS.
       77 WRK-NUM2   PIC 9(02) VALUE ZEROS.
       77 WRK-RESUL  PIC 9(03) VALUE ZEROS.
       77 WRK-RESTO  PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.

           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
      *    SOMA
           ADD WRK-NUM1 WRK-NUM2 TO WRK-RESUL.
           DISPLAY WRK-NUM1' + 'WRK-NUM2 ' = ' WRK-RESUL.

      *    SUBTRAÇÃO
           SUBTRACT WRK-NUM1 FROM WRK-NUM2 GIVING WRK-RESUL.
           DISPLAY WRK-NUM1' - 'WRK-NUM2 ' = ' WRK-RESUL.

      *    DIVIÇÃO e RESTO
           DIVIDE WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESUL
           REMAINDER WRK-RESTO.
           DISPLAY WRK-NUM1' % 'WRK-NUM2 ' = ' WRK-RESUL ' %' WRK-RESTO.

      *    MULTIPLICAÇÃO
           MULTIPLY WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESUL.
           DISPLAY WRK-NUM1' * 'WRK-NUM2 ' = ' WRK-RESUL.

      *    MEDIA DE UM ALUNO
           COMPUTE WRK-RESUL = (WRK-NUM1 + WRK-NUM2) /2.
           DISPLAY 'nota1: 'WRK-NUM1' nota2: 'WRK-NUM2 ' >' WRK-RESUL.

           STOP RUN.
