       IDENTIFICATION DIVISION.
       PROGRAM-ID. COB11-LAGURAR-COMPRIMENTO.
      *******************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = IVAN(ALURA) IVANEL
      * OBJETIVO: RECEBER LARGURA E COMPRIMENTO
      * CALCULAR AREA
      * DATA = XX
      *******************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
    02 77  WRK-LARGURA PIC 9(03)V99 VALUE ZEROS.
       77  WRK-COMPRIMENTO PIC 9(03)V99 VALUE ZEROS.
       77  WRK-AREA        PIC 9(03)V99  VALUE ZEROS.


       PROCEDURE DIVISION.
           DISPLAY 'LARGURA..'
           ACCEPT WRK-LARGURA.

           DISPLAY 'COMPRIMENTO..'
           ACCEPT WRK-COMPRIMENTO.

           IF WRK-LARGURA > AND WRK-COMPRIMENTO > 0
            COMPUTE WRK-AREA = (WRK-LARGURA * WRK-COMPRIMENTO)
              DISPLAY '-------------'.
              DISPLAY 'AREA....' WRK-AREA.
           ELSE
               DISPLAY 'FALTA INFORMA ALGO'
           END-IF.
           STOP RUN.
