       IDENTIFICATION DIVISION.
       PROGRAM-ID. DESAFIO-MAIOR.
      *******************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = IVAN(ALURA) IVANEL
      * OBJETIVO: RECEBER NOME E SALARIO
      * IMPRIMIR FORMATADO - USO DA VIRGULA
      * DATA = XX
      *******************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77 WRK-NOME         PIC X(20) VALUE SPACES.
       77 WRK-SALARIO      PIC 9(06)V99 VALUE ZEROS.

       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
           ACCEPT WRK-SALARIO FROM CONSOLE.

           DISPLAY 'NOME.. ' WRK-NOME ' E SALRIO..'  WRK-SALARIO .


           STOP RUN.
